# -*- coding: UTF-8 -*-
"""
@Project ：wxwx_xa_algorithm 
@File    ：cal_weight.py
@Author  ：探长
@Date    ：2023/3/8 12:28 
"""
# 定义熵值法函数
import numpy as np
import math


def algsMain(*args, **kwargs):
    '''熵值法,计算变量的权重。即：离散程度越大，即信息量越大，不确定性就越小，熵也就越小。
    Args:
    x (list): 包含m个样本和n个特征的数据列表，每个元素为浮点数

    Returns:
    list: 包含每个特征的权重，每个元素为浮点数

    '''
    try:
        '''熵值法,计算变量的权重。即：离散程度越大，即信息量越大，不确定性就越小，熵也就越小。
            Args:
            x (list): 包含m个样本和n个特征的数据列表，每个元素为浮点数

            Returns:
            list: 包含每个特征的权重，每个元素为浮点数

            '''
        x = args[0]
        if (len(x[0])) == 1:
            return True, [1.0]
        # 将列表转换成NumPy数组格式
        x = np.array(x)
        # print(x)
        # 求k
        rows = x.shape[0]  # 行
        cols = x.shape[1]  # 列
        if rows == 1:
            return True, [1 / len(x[0])] * len(x[0])
        k = 1.0 / math.log(rows)

        lnf = np.zeros((rows, cols))

        R = np.zeros((rows, cols))
        # 标准化矩阵X后得到R
        for i in range(0, rows):
            for j in range(0, cols):
                if x.max(axis=0)[j] - x.min(axis=0)[j] == 0:
                    R[i][j] = 1
                else:
                    R[i][j] = (x[i][j] - x.min(axis=0)[j]) / (x.max(axis=0)[j] - x.min(axis=0)[j])

        p = np.zeros((rows, cols))
        # 计算第i个评价对象第j项指标的特征比重p
        for i in range(0, rows):
            for j in range(0, cols):
                p_tmp = R.sum(axis=0)[j]
                p[i][j] = R[i][j] / p_tmp

        # 判断p中的元素是否为0， 如果为0， p(i, j) * ln(p(i, j)) = 0
        # 用中间变量tp表示p(i, j) * ln(p(i, j))
        tp = np.zeros((rows, cols))
        for i in range(0, rows):
            for j in range(0, cols):
                # 根据p(i, j)是否小于等于0给tp赋值
                if p[i][j] <= 0:
                    tp[i][j] = 0
                else:
                    tp[i][j] = p[i][j] * math.log(p[i][j])

        # 计算第j项指标的条件熵H
        H = -tp.sum(axis=0)
        # 计算第j项指标的熵值E
        E = H / math.log(rows)
        # 计算差异系数G
        G = 1 - E
        # 计算熵权W
        if sum(G) == 0:
            return True, [1 / len(x[0])] * len(x[0])
        w = G / sum(G)

        # x = R
        # # 矩阵计算--
        # # 信息熵
        # for i in range(0, rows):
        #     for j in range(0, cols):
        #         if x[i][j] == 0:
        #             lnfij = 0.0
        #         else:
        #             p_tmp = x.sum(axis=0)[j]
        #             p = x[i][j]/p_tmp
        #             lnfij = math.log(p)*p*(-k)
        #         lnf[i][j] = lnfij
        # E = lnf
        #
        # # 计算冗余度
        # d = 1 - E.sum(axis=0)
        # if d[0] == 0:
        #     length = len(x[0])
        #     weight_list = []
        #     for i in range(length):
        #         weight_list.append(1.0/length)
        #     return weight_list
        # # 计算各指标的权重
        # w = np.zeros((cols, 1))
        # # print(w)
        # for j in range(0, cols):
        #     wj = d[j]/sum(d)
        #     w[j] = wj
        for i in w.flatten().tolist():
            if i < 0.00001:
                return True, [1 / len(x[0]) for item in range(len(x[0]))]
        return True, w.flatten().tolist()
    except Exception as e:
        return False, e.args


# 在下面的测试用例中，我把教程中的csv变成了二维列表。在测试文件夹中有原始的CSV计算的例子。
if __name__ == '__main__':
    # list=[[171.33, 151.33, 0.28, 0.0, 106.36, 0.05], [646.66, 370.0, 1.07, 61.0, 1686.79, 1.64],
    #  [533.33, 189.66, 0.59, 0.0, 242.31, 0.57], [28.33, 0.0, 0.17, 0.0, 137.85, 2.29],
    #  [620.0, 234.0, 0.88, 41.33, 428.33, 0.13], [192.33, 177.66, 0.16, 0.0, 128.68, 1.07],
    #  [111.0, 94.0, 0.18, 0.0, 234.27, 0.22], [291.0, 654.0, 1.21, 65.66, 2.26, 0.0],
    #  [421.33, 247.0, 0.7, 0.0, 0.4, 0.0], [193.0, 288.66, 0.16, 0.0, 0.0, 0.0], [82.33, 118.0, 0.11, 0.0, 758.41, 0.24],
    #  [649.66, 648.66, 0.54, 0.0, 13.35, 0.11], [37.66, 103.33, 0.12, 0.0, 1133.51, 1.1],
    #  [183.33, 282.33, 0.55, 0.0, 624.73, 1.04], [1014.66, 1264.66, 5.07, 814.66, 0.0, 0.0],
    #  [90.66, 134.0, 0.3, 0.0, 0.15, 0.0], [200.66, 98.33, 0.33, 0.0, 681.54, 0.51],
    #  [540.66, 558.66, 1.08, 62.0, 2.71, 0.09], [80.0, 60.66, 0.13, 0.0, 910.19, 0.88],
    #  [530.66, 281.33, 0.88, 36.0, 743.21, 0.72], [166.0, 133.0, 0.13, 0.0, 246.88, 2.05],
    #  [377.66, 310.33, 0.57, 0.0, 102.89, 0.57], [143.33, 73.0, 0.23, 0.0, 103.94, 0.1],
    #  [394.66, 473.66, 0.56, 0.0, 1.06, 0.03], [535.66, 447.33, 0.44, 0.0, 10.59, 0.08],
    #  [52.66, 56.66, 0.52, 0.0, 0.0, 0.0], [1381.66, 760.66, 2.3, 781.66, 248.71, 0.13],
    #  [44.33, 42.33, 0.07, 0.0, 0.66, 0.0], [71.66, 62.66, 0.11, 0.0, 535.26, 0.52],
    #  [148.33, 56.66, 0.24, 0.0, 173.83, 0.16]]

    list = [[0.99999791,0.993325524],
            [0.999980745,0.993743548],
            [0.999979974,0.986920952],
            [0.999979974,0.990417466],
            [0.999980984,0.987727007],
            [0.999981458,0.994037684],
            [0.999981755,0.995689727],
            [0.999984829,0.999700267],
            [0.99998423,0.999280965],
            [0.99998423,0.992495636],
            [0.99998423,0.992575743],
            [0.99998423,0.988841336],
            [0.99998423,0.977697008],
            [0.99998423,0.976340467]]

    # 计算df各字段的权重
    data = [[1.0, 1.0], [1.0, 1.0], [1.0, 1.0], [1.0, 1.0], [1.0, 1.0], [1.0, 1.0], [1.0, 1.0], [1.0, 1.0], [1.0, 1.0],
     [1.0, 1.0], [1.0, 1.0], [1.0, 1.0], [1.0, 1.0], [1.0, 1.0], [1.0, 1.0], [1.0, 1.0], [1.0, 1.0], [1.0, 1.0],
     [1.0, 1.0], [1.0, 1.0], [1.0, 1.0], [1.0, 1.0], [1.0, 1.0], [1.0, 1.0], [1.0, 1.0], [1.0, 1.0], [1.0, 1.0],
     [1.0, 1.0], [1.0, 1.0], [1.0, 1.0], [1.0, 1.0], [1.0, 1.0], [1.0, 1.0]]
    config = {}
    w = algsMain(data, **config)  # 调用cal_weight
    # w.index = df.columns
    # w.columns = ['weight']
    print(w)  # [0.0884851832612039, 0.07484049087338501, 0.14020609249225982, 0.41084319015236376, 0.14437430501768214, 0.1412507382031054]
    print('运行完成!')
